k6-configuration-runner/docker-output/logging.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: app/scripts/createdScript.js
     output: json (app/output/output.json)

  scenarios: (100.00%) 3 scenarios, 95 max VUs, 1m40s max duration (incl. graceful stop):
           * warmUp: Up to 50 looping VUs for 40s over 3 stages (gracefulRampDown: 30s, gracefulStop: 5s)
           * work: 40 looping VUs for 20s (startTime: 20s, gracefulStop: 5s)
           * coolDown: 10 iterations for each of 5 VUs (maxDuration: 30s, startTime: 40s, gracefulStop: 30s)


running (0m01.0s), 11/95 VUs, 0 complete and 0 interrupted iterations
warmUp     [   2% ] 11/50 VUs  01.0s/40.0s
work     • [   0% ] waiting    19.0s
coolDown • [   0% ] waiting    39.0s

running (0m02.0s), 13/95 VUs, 0 complete and 0 interrupted iterations
warmUp     [   5% ] 13/50 VUs  02.0s/40.0s
work     • [   0% ] waiting    18.0s
coolDown • [   0% ] waiting    38.0s

running (0m03.0s), 15/95 VUs, 0 complete and 0 interrupted iterations
warmUp     [   7% ] 15/50 VUs  03.0s/40.0s
work     • [   0% ] waiting    17.0s
coolDown • [   0% ] waiting    37.0s

running (0m04.0s), 17/95 VUs, 0 complete and 0 interrupted iterations
warmUp     [  10% ] 17/50 VUs  04.0s/40.0s
work     • [   0% ] waiting    16.0s
coolDown • [   0% ] waiting    36.0s

running (0m05.0s), 19/95 VUs, 0 complete and 0 interrupted iterations
warmUp     [  12% ] 19/50 VUs  05.0s/40.0s
work     • [   0% ] waiting    15.0s
coolDown • [   0% ] waiting    35.0s

running (0m06.0s), 21/95 VUs, 0 complete and 0 interrupted iterations
warmUp     [  15% ] 21/50 VUs  06.0s/40.0s
work     • [   0% ] waiting    14.0s
coolDown • [   0% ] waiting    34.0s

running (0m07.0s), 23/95 VUs, 0 complete and 0 interrupted iterations
warmUp     [  17% ] 23/50 VUs  07.0s/40.0s
work     • [   0% ] waiting    13.0s
coolDown • [   0% ] waiting    33.0s

running (0m08.0s), 25/95 VUs, 0 complete and 0 interrupted iterations
warmUp     [  20% ] 25/50 VUs  08.0s/40.0s
work     • [   0% ] waiting    12.0s
coolDown • [   0% ] waiting    32.0s

running (0m09.0s), 27/95 VUs, 0 complete and 0 interrupted iterations
warmUp     [  22% ] 27/50 VUs  09.0s/40.0s
work     • [   0% ] waiting    11.0s
coolDown • [   0% ] waiting    31.0s

running (0m10.0s), 29/95 VUs, 0 complete and 0 interrupted iterations
warmUp     [  25% ] 29/50 VUs  10.0s/40.0s
work     • [   0% ] waiting    10.0s
coolDown • [   0% ] waiting    30.0s

running (0m11.0s), 30/95 VUs, 0 complete and 0 interrupted iterations
warmUp     [  27% ] 30/50 VUs  11.0s/40.0s
work     • [   0% ] waiting    09.0s
coolDown • [   0% ] waiting    29.0s

running (0m12.0s), 30/95 VUs, 0 complete and 0 interrupted iterations
warmUp     [  30% ] 30/50 VUs  12.0s/40.0s
work     • [   0% ] waiting    08.0s
coolDown • [   0% ] waiting    28.0s

running (0m13.0s), 30/95 VUs, 0 complete and 0 interrupted iterations
warmUp     [  32% ] 30/50 VUs  13.0s/40.0s
work     • [   0% ] waiting    07.0s
coolDown • [   0% ] waiting    27.0s

running (0m14.0s), 30/95 VUs, 0 complete and 0 interrupted iterations
warmUp     [  35% ] 30/50 VUs  14.0s/40.0s
work     • [   0% ] waiting    06.0s
coolDown • [   0% ] waiting    26.0s

running (0m15.0s), 30/95 VUs, 0 complete and 0 interrupted iterations
warmUp     [  37% ] 30/50 VUs  15.0s/40.0s
work     • [   0% ] waiting    05.0s
coolDown • [   0% ] waiting    25.0s

running (0m16.0s), 30/95 VUs, 0 complete and 0 interrupted iterations
warmUp     [  40% ] 30/50 VUs  16.0s/40.0s
work     • [   0% ] waiting    04.0s
coolDown • [   0% ] waiting    24.0s

running (0m17.0s), 30/95 VUs, 0 complete and 0 interrupted iterations
warmUp     [  42% ] 30/50 VUs  17.0s/40.0s
work     • [   0% ] waiting    03.0s
coolDown • [   0% ] waiting    23.0s

running (0m18.0s), 30/95 VUs, 11 complete and 0 interrupted iterations
warmUp     [  45% ] 30/50 VUs  18.0s/40.0s
work     • [   0% ] waiting    02.0s
coolDown • [   0% ] waiting    22.0s

running (0m19.0s), 30/95 VUs, 13 complete and 0 interrupted iterations
warmUp     [  47% ] 30/50 VUs  19.0s/40.0s
work     • [   0% ] waiting    01.0s
coolDown • [   0% ] waiting    21.0s

running (0m20.0s), 30/95 VUs, 15 complete and 0 interrupted iterations
warmUp     [  50% ] 30/50 VUs  20.0s/40.0s
work     • [   0% ] waiting    00.0s
coolDown • [   0% ] waiting    20.0s

running (0m21.0s), 70/95 VUs, 17 complete and 0 interrupted iterations
warmUp     [  52% ] 30/50 VUs  21.0s/40.0s
work       [   5% ] 40 VUs     01.0s/20s
coolDown • [   0% ] waiting    19.0s

running (0m22.0s), 70/95 VUs, 19 complete and 0 interrupted iterations
warmUp     [  55% ] 30/50 VUs  22.0s/40.0s
work       [  10% ] 40 VUs     02.0s/20s
coolDown • [   0% ] waiting    18.0s

running (0m23.0s), 70/95 VUs, 21 complete and 0 interrupted iterations
warmUp     [  57% ] 30/50 VUs  23.0s/40.0s
work       [  15% ] 40 VUs     03.0s/20s
coolDown • [   0% ] waiting    17.0s

running (0m24.0s), 70/95 VUs, 23 complete and 0 interrupted iterations
warmUp     [  60% ] 30/50 VUs  24.0s/40.0s
work       [  20% ] 40 VUs     04.0s/20s
coolDown • [   0% ] waiting    16.0s

running (0m25.0s), 70/95 VUs, 25 complete and 0 interrupted iterations
warmUp     [  62% ] 30/50 VUs  25.0s/40.0s
work       [  25% ] 40 VUs     05.0s/20s
coolDown • [   0% ] waiting    15.0s

running (0m26.0s), 70/95 VUs, 27 complete and 0 interrupted iterations
warmUp     [  65% ] 30/50 VUs  26.0s/40.0s
work       [  30% ] 40 VUs     06.0s/20s
coolDown • [   0% ] waiting    14.0s

running (0m27.0s), 70/95 VUs, 29 complete and 0 interrupted iterations
warmUp     [  67% ] 30/50 VUs  27.0s/40.0s
work       [  35% ] 40 VUs     07.0s/20s
coolDown • [   0% ] waiting    13.0s

running (0m28.0s), 71/95 VUs, 30 complete and 0 interrupted iterations
warmUp     [  70% ] 31/50 VUs  28.0s/40.0s
work       [  40% ] 40 VUs     08.0s/20s
coolDown • [   0% ] waiting    12.0s

running (0m29.0s), 73/95 VUs, 30 complete and 0 interrupted iterations
warmUp     [  72% ] 33/50 VUs  29.0s/40.0s
work       [  45% ] 40 VUs     09.0s/20s
coolDown • [   0% ] waiting    11.0s

running (0m30.0s), 74/95 VUs, 30 complete and 0 interrupted iterations
warmUp     [  75% ] 34/50 VUs  30.0s/40.0s
work       [  50% ] 40 VUs     10.0s/20s
coolDown • [   0% ] waiting    10.0s

running (0m31.0s), 76/95 VUs, 30 complete and 0 interrupted iterations
warmUp     [  77% ] 36/50 VUs  31.0s/40.0s
work       [  55% ] 40 VUs     11.0s/20s
coolDown • [   0% ] waiting    09.0s

running (0m32.0s), 77/95 VUs, 30 complete and 0 interrupted iterations
warmUp     [  80% ] 37/50 VUs  32.0s/40.0s
work       [  60% ] 40 VUs     12.0s/20s
coolDown • [   0% ] waiting    08.0s

running (0m33.0s), 79/95 VUs, 30 complete and 0 interrupted iterations
warmUp     [  82% ] 39/50 VUs  33.0s/40.0s
work       [  65% ] 40 VUs     13.0s/20s
coolDown • [   0% ] waiting    07.0s

running (0m34.0s), 80/95 VUs, 30 complete and 0 interrupted iterations
warmUp     [  85% ] 40/50 VUs  34.0s/40.0s
work       [  70% ] 40 VUs     14.0s/20s
coolDown • [   0% ] waiting    06.0s

running (0m35.0s), 82/95 VUs, 41 complete and 0 interrupted iterations
warmUp     [  87% ] 42/50 VUs  35.0s/40.0s
work       [  75% ] 40 VUs     15.0s/20s
coolDown • [   0% ] waiting    05.0s

running (0m36.0s), 83/95 VUs, 43 complete and 0 interrupted iterations
warmUp     [  90% ] 43/50 VUs  36.0s/40.0s
work       [  80% ] 40 VUs     16.0s/20s
coolDown • [   0% ] waiting    04.0s

running (0m37.0s), 85/95 VUs, 45 complete and 0 interrupted iterations
warmUp     [  92% ] 45/50 VUs  37.0s/40.0s
work       [  85% ] 40 VUs     17.0s/20s
coolDown • [   0% ] waiting    03.0s

running (0m38.0s), 86/95 VUs, 87 complete and 0 interrupted iterations
warmUp     [  95% ] 46/50 VUs  38.0s/40.0s
work       [  90% ] 40 VUs     18.0s/20s
coolDown • [   0% ] waiting    02.0s

running (0m39.0s), 88/95 VUs, 89 complete and 0 interrupted iterations
warmUp     [  97% ] 48/50 VUs  39.0s/40.0s
work       [  95% ] 40 VUs     19.0s/20s
coolDown • [   0% ] waiting    01.0s

running (0m40.0s), 89/95 VUs, 91 complete and 0 interrupted iterations
warmUp     [ 100% ] 49/50 VUs  40.0s/40.0s
work       [ 100% ] 40 VUs     20.0s/20s
coolDown • [   0% ] waiting    00.0s

running (0m41.0s), 92/95 VUs, 93 complete and 0 interrupted iterations
warmUp   ↓ [ 100% ] 49/50 VUs  40s       
work     ↓ [ 100% ] 40 VUs     20s       
coolDown   [   0% ] 5 VUs      01.0s/30s  00/50 iters, 10 per VU

running (0m42.0s), 90/95 VUs, 95 complete and 0 interrupted iterations
warmUp   ↓ [ 100% ] 49/50 VUs  40s       
work     ↓ [ 100% ] 40 VUs     20s       
coolDown   [   0% ] 5 VUs      02.0s/30s  00/50 iters, 10 per VU

running (0m43.0s), 88/95 VUs, 97 complete and 0 interrupted iterations
warmUp   ↓ [ 100% ] 49/50 VUs  40s       
work     ↓ [ 100% ] 40 VUs     20s       
coolDown   [   0% ] 5 VUs      03.0s/30s  00/50 iters, 10 per VU

running (0m44.0s), 86/95 VUs, 99 complete and 0 interrupted iterations
warmUp   ↓ [ 100% ] 49/50 VUs  40s       
work     ↓ [ 100% ] 40 VUs     20s       
coolDown   [   0% ] 5 VUs      04.0s/30s  00/50 iters, 10 per VU

running (0m45.0s), 84/95 VUs, 101 complete and 0 interrupted iterations
warmUp   ↓ [ 100% ] 49/50 VUs  40s       
work     ↓ [ 100% ] 40 VUs     20s       
coolDown   [   0% ] 5 VUs      05.0s/30s  00/50 iters, 10 per VU

running (0m46.0s), 05/95 VUs, 101 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [   0% ] 5 VUs      06.0s/30s  00/50 iters, 10 per VU

running (0m47.0s), 05/95 VUs, 101 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [   0% ] 5 VUs      07.0s/30s  00/50 iters, 10 per VU

running (0m48.0s), 05/95 VUs, 101 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [   0% ] 5 VUs      08.0s/30s  00/50 iters, 10 per VU

running (0m49.0s), 05/95 VUs, 101 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [   0% ] 5 VUs      09.0s/30s  00/50 iters, 10 per VU

running (0m50.0s), 05/95 VUs, 101 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [   0% ] 5 VUs      10.0s/30s  00/50 iters, 10 per VU

running (0m51.0s), 05/95 VUs, 101 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [   0% ] 5 VUs      11.0s/30s  00/50 iters, 10 per VU

running (0m52.0s), 05/95 VUs, 101 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [   0% ] 5 VUs      12.0s/30s  00/50 iters, 10 per VU

running (0m53.0s), 05/95 VUs, 101 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [   0% ] 5 VUs      13.0s/30s  00/50 iters, 10 per VU

running (0m54.0s), 05/95 VUs, 101 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [   0% ] 5 VUs      14.0s/30s  00/50 iters, 10 per VU

running (0m55.0s), 05/95 VUs, 101 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [   0% ] 5 VUs      15.0s/30s  00/50 iters, 10 per VU

running (0m56.0s), 05/95 VUs, 101 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [   0% ] 5 VUs      16.0s/30s  00/50 iters, 10 per VU

running (0m57.0s), 05/95 VUs, 101 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [   0% ] 5 VUs      17.0s/30s  00/50 iters, 10 per VU

running (0m58.0s), 05/95 VUs, 106 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [  10% ] 5 VUs      18.0s/30s  05/50 iters, 10 per VU

running (0m59.0s), 05/95 VUs, 106 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [  10% ] 5 VUs      19.0s/30s  05/50 iters, 10 per VU

running (1m00.0s), 05/95 VUs, 106 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [  10% ] 5 VUs      20.0s/30s  05/50 iters, 10 per VU

running (1m01.0s), 05/95 VUs, 106 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [  10% ] 5 VUs      21.0s/30s  05/50 iters, 10 per VU

running (1m02.0s), 05/95 VUs, 106 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [  10% ] 5 VUs      22.0s/30s  05/50 iters, 10 per VU

running (1m03.0s), 05/95 VUs, 106 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [  10% ] 5 VUs      23.0s/30s  05/50 iters, 10 per VU

running (1m04.0s), 05/95 VUs, 106 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [  10% ] 5 VUs      24.0s/30s  05/50 iters, 10 per VU

running (1m05.0s), 05/95 VUs, 106 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [  10% ] 5 VUs      25.0s/30s  05/50 iters, 10 per VU

running (1m06.0s), 05/95 VUs, 106 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [  10% ] 5 VUs      26.0s/30s  05/50 iters, 10 per VU

running (1m07.0s), 05/95 VUs, 106 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [  10% ] 5 VUs      27.0s/30s  05/50 iters, 10 per VU

running (1m08.0s), 05/95 VUs, 106 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [  10% ] 5 VUs      28.0s/30s  05/50 iters, 10 per VU

running (1m09.0s), 05/95 VUs, 106 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [  10% ] 5 VUs      29.0s/30s  05/50 iters, 10 per VU

running (1m10.0s), 05/95 VUs, 106 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s       
work     ✓ [ 100% ] 40 VUs     20s       
coolDown   [  10% ] 5 VUs      30.0s/30s  05/50 iters, 10 per VU

running (1m11.0s), 05/95 VUs, 106 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s 
work     ✓ [ 100% ] 40 VUs     20s 
coolDown ↓ [ 100% ] 5 VUs      30s  05/50 iters, 10 per VU

running (1m12.0s), 05/95 VUs, 106 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s 
work     ✓ [ 100% ] 40 VUs     20s 
coolDown ↓ [ 100% ] 5 VUs      30s  05/50 iters, 10 per VU

running (1m13.0s), 05/95 VUs, 106 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s 
work     ✓ [ 100% ] 40 VUs     20s 
coolDown ↓ [ 100% ] 5 VUs      30s  05/50 iters, 10 per VU

running (1m14.0s), 05/95 VUs, 106 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s 
work     ✓ [ 100% ] 40 VUs     20s 
coolDown ↓ [ 100% ] 5 VUs      30s  05/50 iters, 10 per VU

running (1m14.1s), 00/95 VUs, 111 complete and 79 interrupted iterations
warmUp   ✓ [ 100% ] 39/50 VUs  40s 
work     ✓ [ 100% ] 40 VUs     20s 
coolDown ✓ [ 100% ] 5 VUs      30s  10/50 iters, 10 per VU

     ✓ GET status was 200
     ✓ GET body size >= 1
     ✓ body includes id
     ✓ error_code was 0
     ✓ POST status was 201
     ✓ PUT status was 200
     ✓ DELETE status was 204

     checks.........................: 100.00% ✓ 1562      ✗ 0   
     data_received..................: 793 kB  11 kB/s
     data_sent......................: 108 kB  1.5 kB/s
     dropped_iterations.............: 40      0.540168/s
     http_req_blocked...............: avg=85.82µs  min=1.1µs   med=6µs     max=2.31ms  p(90)=249.88µs p(95)=766.16µs
     http_req_connecting............: avg=54.77µs  min=0s      med=0s      max=1.99ms  p(90)=168.27µs p(95)=504.71µs
   ✗ http_req_duration..............: avg=5.78ms   min=789.3µs med=2.97ms  max=80.25ms p(90)=6.36ms   p(95)=9.39ms  
       { expected_response:true }...: avg=5.78ms   min=789.3µs med=2.97ms  max=80.25ms p(90)=6.36ms   p(95)=9.39ms  
     ✓ { group:home }...............: avg=12.55ms  min=828.7µs med=5.08ms  max=80.25ms p(90)=57.49ms  p(95)=78.88ms 
   ✓ http_req_failed................: 0.00%   ✓ 0         ✗ 802 
     http_req_receiving.............: avg=186.89µs min=12.4µs  med=97.45µs max=3.12ms  p(90)=450.73µs p(95)=664.35µs
     http_req_sending...............: avg=79.88µs  min=3.8µs   med=36.9µs  max=1.72ms  p(90)=157.32µs p(95)=275.87µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=5.51ms   min=705.2µs med=2.66ms  max=80.03ms p(90)=5.92ms   p(95)=9.33ms  
     http_reqs......................: 802     10.830376/s
     iteration_duration.............: avg=17.04s   min=17.01s  med=17.02s  max=17.12s  p(90)=17.09s   p(95)=17.12s  
     iterations.....................: 111     1.498967/s
     vus............................: 5       min=5       max=92
     vus_max........................: 95      min=95      max=95